#### Terraform Init: `✅`
#### Terraform Plan: `✅ 2 to add, 5 to change, 0 to destroy.`

<details>
<summary>Show Plan</summary>

```
[command]/home/runner/work/_temp/9329058b-627e-4e76-8ee2-f53af18b48e6/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
data.hetznerdns_zone.this: Reading...
hcloud_network.this: Refreshing state... [id=10373733]
hcloud_ssh_key.default: Refreshing state... [id=24905759]
hcloud_firewall.basic: Refreshing state... [id=1748182]
data.hcloud_image.this: Reading...
data.cloudinit_config.this: Reading...
data.cloudinit_config.this: Read complete after 0s [id=3370040635]
data.hcloud_image.this: Read complete after 1s
hcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]
hcloud_server.projects-server: Refreshing state... [id=56699617]
hcloud_server_network.this: Refreshing state... [id=56699617-10373733]
hcloud_volume.this: Refreshing state... [id=101632658]
data.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]
hetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]
hetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]
hetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]
hetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # hcloud_server.projects-server has been deleted
  - resource "hcloud_server" "projects-server" {
      - id                         = "56699617" -> null
      - ipv4_address               = "188.245.227.94" -> null
        name                       = "projects-server"
      - status                     = "running" -> null
        # (20 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # hcloud_server.projects-server will be created
  + resource "hcloud_server" "projects-server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 1748182,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "201540631"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "fsn1"
      + name                       = "projects-server"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "24905759",
        ]
      + status                     = (known after apply)
      + user_data                  = "UBf878EBFpGe+OCxIJUNckTmbYA="
    }

  # hcloud_server_network.this will be created
  + resource "hcloud_server_network" "this" {
      + id          = (known after apply)
      + ip          = "10.0.1.2"
      + mac_address = (known after apply)
      + network_id  = 10373733
      + server_id   = (known after apply)
    }

  # hcloud_volume.this will be updated in-place
  ~ resource "hcloud_volume" "this" {
        id                = "101632658"
        name              = "persistent-storage"
      ~ server_id         = 56699617 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks" {
        id      = "da4433c705ee878f5f69348f54b956ef"
        name    = "bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks-api will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks-api" {
        id      = "81253d86efc1c38e4afb06c662d6a409"
        name    = "api.bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.geometrierechner will be updated in-place
  ~ resource "hetznerdns_record" "geometrierechner" {
        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"
        name    = "geometrierechner"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.homepage will be updated in-place
  ~ resource "hetznerdns_record" "homepage" {
        id      = "912db7ec956005d7343406b8b2adb320"
        name    = "@"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ server_ip = "188.245.227.94" -> (known after apply)
  ~ status    = "running" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Adata.hetznerdns_zone.this: Reading...%0Ahcloud_network.this: Refreshing state... [id=10373733]%0Ahcloud_ssh_key.default: Refreshing state... [id=24905759]%0Ahcloud_firewall.basic: Refreshing state... [id=1748182]%0Adata.hcloud_image.this: Reading...%0Adata.cloudinit_config.this: Reading...%0Adata.cloudinit_config.this: Read complete after 0s [id=3370040635]%0Adata.hcloud_image.this: Read complete after 1s%0Ahcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]%0Ahcloud_server.projects-server: Refreshing state... [id=56699617]%0Ahcloud_server_network.this: Refreshing state... [id=56699617-10373733]%0Ahcloud_volume.this: Refreshing state... [id=101632658]%0Adata.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]%0Ahetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]%0Ahetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]%0Ahetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]%0Ahetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # hcloud_server.projects-server has been deleted%0A  - resource "hcloud_server" "projects-server" {%0A      - id                         = "56699617" -> null%0A      - ipv4_address               = "188.245.227.94" -> null%0A        name                       = "projects-server"%0A      - status                     = "running" -> null%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # hcloud_server.projects-server will be created%0A  + resource "hcloud_server" "projects-server" {%0A      + allow_deprecated_images    = false%0A      + backup_window              = (known after apply)%0A      + backups                    = false%0A      + datacenter                 = (known after apply)%0A      + delete_protection          = false%0A      + firewall_ids               = [%0A          + 1748182,%0A        ]%0A      + id                         = (known after apply)%0A      + ignore_remote_firewall_ids = false%0A      + image                      = "201540631"%0A      + ipv4_address               = (known after apply)%0A      + ipv6_address               = (known after apply)%0A      + ipv6_network               = (known after apply)%0A      + keep_disk                  = false%0A      + location                   = "fsn1"%0A      + name                       = "projects-server"%0A      + primary_disk_size          = (known after apply)%0A      + rebuild_protection         = false%0A      + server_type                = "cx22"%0A      + shutdown_before_deletion   = false%0A      + ssh_keys                   = [%0A          + "24905759",%0A        ]%0A      + status                     = (known after apply)%0A      + user_data                  = "UBf878EBFpGe+OCxIJUNckTmbYA="%0A    }%0A%0A  # hcloud_server_network.this will be created%0A  + resource "hcloud_server_network" "this" {%0A      + id          = (known after apply)%0A      + ip          = "10.0.1.2"%0A      + mac_address = (known after apply)%0A      + network_id  = 10373733%0A      + server_id   = (known after apply)%0A    }%0A%0A  # hcloud_volume.this will be updated in-place%0A  ~ resource "hcloud_volume" "this" {%0A        id                = "101632658"%0A        name              = "persistent-storage"%0A      ~ server_id         = 56699617 -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks" {%0A        id      = "da4433c705ee878f5f69348f54b956ef"%0A        name    = "bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks-api will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks-api" {%0A        id      = "81253d86efc1c38e4afb06c662d6a409"%0A        name    = "api.bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.geometrierechner will be updated in-place%0A  ~ resource "hetznerdns_record" "geometrierechner" {%0A        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"%0A        name    = "geometrierechner"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.homepage will be updated in-place%0A  ~ resource "hetznerdns_record" "homepage" {%0A        id      = "912db7ec956005d7343406b8b2adb320"%0A        name    = "@"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 5 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ server_ip = "188.245.227.94" -> (known after apply)%0A  ~ status    = "running" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Acquiring state lock. This may take a few moments...%0Adata.hetznerdns_zone.this: Reading...%0Ahcloud_network.this: Refreshing state... [id=10373733]%0Ahcloud_ssh_key.default: Refreshing state... [id=24905759]%0Ahcloud_firewall.basic: Refreshing state... [id=1748182]%0Adata.hcloud_image.this: Reading...%0Adata.cloudinit_config.this: Reading...%0Adata.cloudinit_config.this: Read complete after 0s [id=3370040635]%0Adata.hcloud_image.this: Read complete after 1s%0Ahcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]%0Ahcloud_server.projects-server: Refreshing state... [id=56699617]%0Ahcloud_server_network.this: Refreshing state... [id=56699617-10373733]%0Ahcloud_volume.this: Refreshing state... [id=101632658]%0Adata.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]%0Ahetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]%0Ahetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]%0Ahetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]%0Ahetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # hcloud_server.projects-server has been deleted%0A  - resource "hcloud_server" "projects-server" {%0A      - id                         = "56699617" -> null%0A      - ipv4_address               = "188.245.227.94" -> null%0A        name                       = "projects-server"%0A      - status                     = "running" -> null%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # hcloud_server.projects-server will be created%0A  + resource "hcloud_server" "projects-server" {%0A      + allow_deprecated_images    = false%0A      + backup_window              = (known after apply)%0A      + backups                    = false%0A      + datacenter                 = (known after apply)%0A      + delete_protection          = false%0A      + firewall_ids               = [%0A          + 1748182,%0A        ]%0A      + id                         = (known after apply)%0A      + ignore_remote_firewall_ids = false%0A      + image                      = "201540631"%0A      + ipv4_address               = (known after apply)%0A      + ipv6_address               = (known after apply)%0A      + ipv6_network               = (known after apply)%0A      + keep_disk                  = false%0A      + location                   = "fsn1"%0A      + name                       = "projects-server"%0A      + primary_disk_size          = (known after apply)%0A      + rebuild_protection         = false%0A      + server_type                = "cx22"%0A      + shutdown_before_deletion   = false%0A      + ssh_keys                   = [%0A          + "24905759",%0A        ]%0A      + status                     = (known after apply)%0A      + user_data                  = "UBf878EBFpGe+OCxIJUNckTmbYA="%0A    }%0A%0A  # hcloud_server_network.this will be created%0A  + resource "hcloud_server_network" "this" {%0A      + id          = (known after apply)%0A      + ip          = "10.0.1.2"%0A      + mac_address = (known after apply)%0A      + network_id  = 10373733%0A      + server_id   = (known after apply)%0A    }%0A%0A  # hcloud_volume.this will be updated in-place%0A  ~ resource "hcloud_volume" "this" {%0A        id                = "101632658"%0A        name              = "persistent-storage"%0A      ~ server_id         = 56699617 -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks" {%0A        id      = "da4433c705ee878f5f69348f54b956ef"%0A        name    = "bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks-api will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks-api" {%0A        id      = "81253d86efc1c38e4afb06c662d6a409"%0A        name    = "api.bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.geometrierechner will be updated in-place%0A  ~ resource "hetznerdns_record" "geometrierechner" {%0A        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"%0A        name    = "geometrierechner"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.homepage will be updated in-place%0A  ~ resource "hetznerdns_record" "homepage" {%0A        id      = "912db7ec956005d7343406b8b2adb320"%0A        name    = "@"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 5 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ server_ip = "188.245.227.94" -> (known after apply)%0A  ~ status    = "running" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

</details>
<!-- thollander/actions-comment-pull-request "execution" -->